import os

# ===========================
# 🔐 TOKEN — токен твоего бота
# ===========================
TOKEN = os.getenv("BOT_TOKEN") or "8134649307:AAH3k13igSnG9t6lGYYTvu7e2D4RiKaCXMI"


# ===========================
# 👑 Список администраторов
# Можно добавить сколько угодно ID
# ===========================
ADMINS = {
    7967404620,   # пример
    # добавляй свои ID
}


# ===========================
# 📌 Настройки проекта
# ===========================
DATABASE_NAME = "anon_bot.db"     # SQLite файл
DEBUG = True                      # оставить True — удобно для GSM Hosting
