import os

# =========================
# ОСНОВНОЕ
# =========================

# Токен бота (ОБЯЗАТЕЛЬНО)
TOKEN = os.getenv("BOT_TOKEN", "8134649307:AAH3k13igSnG9t6lGYYTvu7e2D4RiKaCXMI")

# Юзернейм бота без @
BOT_USERNAME = "Who_Anonim_Bot"


# =========================
# АДМИНЫ
# =========================

# ID админов (можно несколько)
ADMINS = {7967404620}  # второй админ (пример)


# =========================
# БАЗА ДАННЫХ
# =========================

DB_NAME = "database.db"


# =========================
# АНОНИМНОСТЬ
# =========================

# длина кода анонимной ссылки
ANON_CODE_LENGTH = 8


# =========================
# РУЛЕТКА
# =========================

ROULETTE_TIMEOUT = 120  # сек
